RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.0.0_a53641a/components/libraries/usbd/class/msc/app_usbd_msc.c
    class_iface = app_usbd_class_iface_get(p_inst, APP_USBD_MSC_IFACE_IDX);

    app_usbd_class_ep_conf_t const * ep_cfg;
    ep_cfg = app_usbd_class_iface_ep_get(class_iface, APP_USBD_MSC_EPOUT_IDX);

    return app_usbd_class_ep_address_get(ep_cfg);
}


/**
 * @brief Command Block Wrapper trigger
 *
 * @param[in] p_inst    Generic class instance
 * @param[in] state     Next state transition
 *
 * @return Standard error code
 * */
static ret_code_t cbw_wait_start(app_usbd_class_inst_t const * p_inst)
{
    app_usbd_msc_t const * p_msc     = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx = msc_ctx_get(p_msc);

    nrf_drv_usbd_ep_t ep_addr_out = ep_out_addr_get(p_inst);

    NRF_LOG_DEBUG("cbw_wait_start");
    memset(&p_msc_ctx->cbw, 0, sizeof(app_usbd_msc_cbw_t));
    NRF_DRV_USBD_TRANSFER_OUT(cbw, &p_msc_ctx->cbw, sizeof(app_usbd_msc_cbw_t));
    ret_code_t ret = app_usbd_ep_transfer(ep_addr_out, &cbw);
    if (ret == NRF_SUCCESS)
    {
        p_msc_ctx->state = APP_USBD_MSC_STATE_CBW;
    }

    return ret;
}


/**
 * @brief Command Status Wrapper trigger
 *
 * @param[in] p_inst    Generic class instance
 * @param[in] state     Next state transition
 *
 * @return Standard error code
 * */
static ret_code_t csw_wait_start(app_usbd_class_inst_t const * p_inst, uint8_t status)
{
    app_usbd_msc_t const * p_msc     = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx = msc_ctx_get(p_msc);

    nrf_drv_usbd_ep_t ep_addr_in = ep_in_addr_get(p_inst);

    memset(&p_msc_ctx->csw, 0, sizeof(app_usbd_msc_csw_t));
    memcpy(p_msc_ctx->csw.signature, APP_USBD_MSC_CSW_SIGNATURE, sizeof(p_msc_ctx->csw.signature));
    memcpy(p_msc_ctx->csw.tag, p_msc_ctx->cbw.tag, sizeof(p_msc_ctx->csw.tag));
    memcpy(p_msc_ctx->csw.residue, &p_msc_ctx->current.residue, sizeof(uint32_t));
    p_msc_ctx->csw.status = status;

    NRF_DRV_USBD_TRANSFER_IN(csw, &p_msc_ctx->csw, sizeof(app_usbd_msc_csw_t));
    ret_code_t ret = app_usbd_ep_transfer(ep_addr_in, &csw);
    if (ret == NRF_SUCCESS)
    {
        p_msc_ctx->state = APP_USBD_MSC_STATE_CSW;
    }

    return ret;
}


/**
 * @brief IN transfer trigger
 *
 * @param[in] p_inst    Generic class instance
 * @param[in] p_buff    IN transfer data buffer
 * @param[in] size      IN transfer size
 * @param[in] state     Next state transition
 *
 * @return Standard error code
 * */
static ret_code_t transfer_in_start(app_usbd_class_inst_t const * p_inst,
                                    void const                  * p_buff,
                                    size_t                        size,
                                    app_usbd_msc_state_t          state)
{
    app_usbd_msc_t const * p_msc     = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx = msc_ctx_get(p_msc);

    NRF_LOG_DEBUG("transfer_in_start: p_buff: %p, size: %u", (uint32_t)p_buff, size);

    nrf_drv_usbd_ep_t ep_addr_in = ep_in_addr_get(p_inst);

    NRF_DRV_USBD_TRANSFER_IN(resp, p_buff, size);
    ret_code_t ret = app_usbd_ep_transfer(ep_addr_in, &resp);
    if (ret == NRF_SUCCESS)
    {
        p_msc_ctx->state = state;
    }
    return ret;
}


/**
 * @brief MSC reset request handler @ref  APP_USBD_MSC_REQ_BULK_RESET
 *
 * @param[in] p_inst    Generic class instance
 *
 * */
static void bulk_ep_reset(app_usbd_class_inst_t const * p_inst)
{
    nrf_drv_usbd_ep_t ep_addr_in  = ep_in_addr_get(p_inst);
    nrf_drv_usbd_ep_t ep_addr_out = ep_out_addr_get(p_inst);

    nrf_drv_usbd_ep_abort(ep_addr_in);
    nrf_drv_usbd_ep_abort(ep_addr_out);
}


/**
 * @brief OUT transfer trigger
 *
 * @param[in] p_inst    Generic class instance
 * @param[in] p_buff    OUT transfer data buffer
 * @param[in] size      OUT transfer size
 * @param[in] state     Next state transition
 *
 * @return Standard error code
 * */
static ret_code_t transfer_out_start(app_usbd_class_inst_t const * p_inst,
                                     void                        * p_buff,
                                     size_t                        size,
                                     app_usbd_msc_state_t          state)
{
    app_usbd_msc_t const * p_msc     = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx = msc_ctx_get(p_msc);

    NRF_LOG_DEBUG("transfer_out_start: p_buff: %p, size: %u", (uint32_t)p_buff, size);
    nrf_drv_usbd_ep_t ep_addr_out = ep_out_addr_get(p_inst);

    NRF_DRV_USBD_TRANSFER_OUT(resp, p_buff, size);
    ret_code_t ret = app_usbd_ep_transfer(ep_addr_out, &resp);
    if (ret == NRF_SUCCESS)
    {
        p_msc_ctx->state = state;
    }
    return ret;
}


/**
 * @brief Generic function to stall communication endpoints and mark error state
 *
 * Function used internally to stall all communication endpoints and mark current state.
 *
 * @param p_inst Generic class instance
 * @param state  State to set
 */
static void status_generic_error_stall(app_usbd_class_inst_t const * p_inst,
                                       app_usbd_msc_state_t          state)
{
    app_usbd_msc_t const * p_msc     = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx = msc_ctx_get(p_msc);

    nrf_drv_usbd_ep_t ep_in  = ep_in_addr_get(p_inst);
    nrf_drv_usbd_ep_t ep_out = ep_out_addr_get(p_inst);

    nrf_drv_usbd_ep_stall(ep_in);
    nrf_drv_usbd_ep_stall(ep_out);
    nrf_drv_usbd_ep_abort(ep_in);
    nrf_drv_usbd_ep_abort(ep_out);

    p_msc_ctx->state = state;
}


/**
 * @brief Start status stage of unsupported SCSI command
 *
 * @param[in,out] p_inst    Generic class instance
 *
 * @return Standard error code
 *
 * @sa status_generic_error_stall
 */
static ret_code_t status_unsupported_start(app_usbd_class_inst_t const * p_inst)
{
    app_usbd_msc_t const * p_msc      = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx  = msc_ctx_get(p_msc);
    bool                   data_stage = uint32_decode(p_msc_ctx->cbw.datlen) != 0;

    if (!data_stage)
    {
        /* Try to transfer the response now */
        ret_code_t ret;
        ret = csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_FAIL);
        if (ret == NRF_SUCCESS)
        {
            return ret;
        }
    }

    /* Cannot transfer failed response in current command - stall the endpoints and postpone the answer */
    status_generic_error_stall(p_inst, APP_USBD_MSC_STATE_UNSUPPORTED);
    if (data_stage)
    {
        if (!(p_msc_ctx->cbw.flags & APP_USBD_MSC_CBW_DIRECTION_IN))
        {
            nrf_drv_usbd_transfer_out_drop(ep_out_addr_get(p_inst));
        }
        /* Unsupported command so we did not process any data - mark it in current residue value */
        p_msc_ctx->current.residue = uint32_decode(p_msc_ctx->cbw.datlen);
    }
    return NRF_SUCCESS;
}


/**
 * @brief Start status stage of CBW invalid
 *
 * @param[in,out] p_inst    Generic class instance
 *
 * @sa status_generic_error_stall
 */
static void status_cbwinvalid_start(app_usbd_class_inst_t const * p_inst)
{
    status_generic_error_stall(p_inst, APP_USBD_MSC_STATE_CBW_INVALID);
}


/**
 * @brief Start status stage of internal device error
 *
 * Kind of error that requires bulk reset but does not stall endpoint permanently - the correct
 * answer is possible.
 *
 * @param[in] p_inst    Generic class instance
 *
 * @sa status_generic_error_stall
 */
static void status_deverror_start(app_usbd_class_inst_t const * p_inst)
{
    status_generic_error_stall(p_inst, APP_USBD_MSC_STATE_DEVICE_ERROR);
}


/**
 * @brief Internal SETUP standard IN request handler
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_setup_ev    Setup event
 *
 * @return Standard error code
 * @retval NRF_SUCCESS if request handled correctly
 * @retval NRF_ERROR_NOT_SUPPORTED if request is not supported
 */
static ret_code_t setup_req_std_in(app_usbd_class_inst_t const * p_inst,
                                   app_usbd_setup_evt_t const  * p_setup_ev)
{
    /* Only Get Descriptor standard IN request is supported by MSC class */
    if ((app_usbd_setup_req_rec(p_setup_ev->setup.bmRequestType) == APP_USBD_SETUP_REQREC_INTERFACE)
        &&
        (p_setup_ev->setup.bmRequest == APP_USBD_SETUP_STDREQ_GET_DESCRIPTOR))
    {
        size_t dsc_len = 0;
        size_t max_size;

        uint8_t * p_trans_buff = app_usbd_core_setup_transfer_buff_get(&max_size);

        /* Try to find descriptor in class internals*/
        ret_code_t ret = app_usbd_class_descriptor_find(
            p_inst,
            p_setup_ev->setup.wValue.hb,
            p_setup_ev->setup.wValue.lb,
            p_trans_buff,
            &dsc_len);

        if (ret != NRF_ERROR_NOT_FOUND)
        {
            ASSERT(dsc_len < NRF_DRV_USBD_EPSIZE);
            return app_usbd_core_setup_rsp(&(p_setup_ev->setup), p_trans_buff, dsc_len);
        }
    }
    return NRF_ERROR_NOT_SUPPORTED;
}


/**
 * @brief Internal SETUP standard OUT request handler
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_setup_ev    Setup event
 *
 * @return Standard error code
 * @retval NRF_SUCCESS if request handled correctly
 * @retval NRF_ERROR_NOT_SUPPORTED if request is not supported
 * @retval NRF_ERROR_FORBIDDEN if endpoint stall cannot be cleared because of internal state
 */
static ret_code_t setup_req_std_out(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_setup_evt_t const  * p_setup_ev)
{
    app_usbd_msc_t const * p_msc     = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx = msc_ctx_get(p_msc);

    app_usbd_setup_reqrec_t req_rec = app_usbd_setup_req_rec(p_setup_ev->setup.bmRequestType);

    if ((req_rec == APP_USBD_SETUP_REQREC_ENDPOINT) &&
        (p_setup_ev->setup.bmRequest == APP_USBD_SETUP_STDREQ_CLEAR_FEATURE) &&
        (p_setup_ev->setup.wValue.w == APP_USBD_SETUP_STDFEATURE_ENDPOINT_HALT))
    {
        if (p_msc_ctx->state == APP_USBD_MSC_STATE_CBW_INVALID)
        {
            return NRF_ERROR_FORBIDDEN;
        }
        ret_code_t ret = NRF_SUCCESS;
        /* Clearing endpoint here. It is done normally inside app_usbd, but we are overwritting this functionality */
        nrf_drv_usbd_ep_t ep_addr = (nrf_drv_usbd_ep_t)(p_setup_ev->setup.wIndex.lb);
        nrf_drv_usbd_ep_dtoggle_clear(ep_addr);
        nrf_drv_usbd_ep_stall_clear(ep_addr);
        if (NRF_USBD_EPIN_CHECK(ep_addr))
        {
            switch (p_msc_ctx->state)
            {
                case APP_USBD_MSC_STATE_UNSUPPORTED:
                {
                    nrf_drv_usbd_ep_stall_clear(ep_out_addr_get(p_inst));
                    /*Unsupported command handle: status stage*/
                    ret = csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_FAIL);
                    if (ret != NRF_SUCCESS)
                    {
                        NRF_LOG_ERROR("Unexpected csw_wait_start on ep clear: %d", ret);
                    }
                    break;
                }

