RT-Thread/rt-thread/bsp/nrf52840/nRF5_SDK_15.0.0_a53641a/components/libraries/usbd/class/msc/app_usbd_msc.c
    p_msc_ctx->current.trans_in_progress = false;
    if ((p_msc_ctx->current.req_busy_mask != APP_USBD_MSC_REQ_BUSY_FULL_MASK) &&
        (p_msc_ctx->current.blk_datasize > p_msc_ctx->current.blk_count * blk_size))
    {
        size_t size = p_msc_ctx->current.blk_datasize - p_msc_ctx->current.blk_count * blk_size;
        if (size > p_msc_ctx->current.blk_count * blk_size)
        {
            size = p_msc_ctx->current.blk_count * blk_size;
        }

        if (size)
        {
            ret = transfer_out_start(p_inst,
                                     ((uint8_t *)p_msc->specific.inst.p_block_buff +
                                      p_msc_ctx->current.workbuff_pos),
                                     size,
                                     APP_USBD_MSC_STATE_DATA_OUT);
            if (ret == NRF_SUCCESS)
            {
                p_msc_ctx->current.trans_req_id ^= 1;
                APP_USBD_MSC_REQ_BUSY_SET(p_msc_ctx->current.req_busy_mask,
                                          p_msc_ctx->current.trans_req_id);
                p_msc_ctx->current.workbuff_pos     ^= p_msc->specific.inst.block_buff_size;
                p_msc_ctx->current.trans_in_progress = true;
            }
        }
    }

    if (!p_msc_ctx->current.block_req_in_progress)
    {
        nrf_block_dev_t const * p_blkd =
            p_msc->specific.inst.pp_block_devs[p_msc_ctx->current.lun];

        size_t pos = p_msc_ctx->current.workbuff_pos;
        if (p_msc_ctx->current.req_busy_mask != APP_USBD_MSC_REQ_BUSY_FULL_MASK)
        {
            pos ^= p_msc->specific.inst.block_buff_size;
        }

        NRF_BLOCK_DEV_REQUEST(req,
                              p_msc_ctx->current.blk_idx,
                              p_msc_ctx->current.blk_count,
                              ((uint8_t *)p_msc->specific.inst.p_block_buff + pos));

        NRF_LOG_DEBUG("nrf_blk_dev_write_req 1: id: %u, count: %u, left: %u, ptr: %p",
                      req.blk_id,
                      req.blk_count,
                      p_msc_ctx->current.blk_datasize,
                      (uint32_t)req.p_buff);

        p_msc_ctx->current.block_req_in_progress = true;
        ret = nrf_blk_dev_write_req(p_blkd, &req);
        NRF_LOG_DEBUG("nrf_blk_dev_write_req 1: ret: %u", ret);
    }

    return ret;
}


/**
 * @brief Endpoint OUT event handler
 *
 * @param[in] p_inst        Generic class instance
 * @param[in] p_setup_ev    Setup event
 *
 * @return Standard error code
 * @retval NRF_SUCCESS if request handled correctly
 * @retval NRF_ERROR_NOT_SUPPORTED if request is not supported
 */
static ret_code_t endpoint_out_event_handler(app_usbd_class_inst_t const  * p_inst,
                                             app_usbd_complex_evt_t const * p_event)
{
    app_usbd_msc_t const * p_msc     = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx = msc_ctx_get(p_msc);

    NRF_LOG_DEBUG("state: %d, ep out event, status: %d",
                  p_msc_ctx->state,
                  p_event->drv_evt.data.eptransfer.status);

    ret_code_t ret = NRF_SUCCESS;
    if (p_event->drv_evt.data.eptransfer.status == NRF_USBD_EP_WAITING)
    {
        if (p_msc_ctx->state == APP_USBD_MSC_STATE_DATA_OUT)
        {
            NRF_LOG_DEBUG("NRF_USBD_EP_WAITING");
        }
        else if (p_msc_ctx->state == APP_USBD_MSC_STATE_CSW ||
                 p_msc_ctx->state == APP_USBD_MSC_STATE_IDLE)
        {
            ret = cbw_wait_start(p_inst);
        }

        return ret;
    }
    else if (p_event->drv_evt.data.eptransfer.status == NRF_USBD_EP_ABORTED)
    {
        p_msc_ctx->state = APP_USBD_MSC_STATE_IDLE;
        return NRF_SUCCESS;
    }
    else if (p_event->drv_evt.data.eptransfer.status == NRF_USBD_EP_OVERLOAD)
    {
        NRF_LOG_ERROR("Data overload");

        switch (p_msc_ctx->state)
        {
            case APP_USBD_MSC_STATE_DATA_OUT:
            {
                status_deverror_start(p_inst);
            }

            /* Default action is the same like CBW - stall totally until bulk reset */
            case APP_USBD_MSC_STATE_CBW:
            default:
            {
                status_cbwinvalid_start(p_inst);
            }
        }
        return NRF_SUCCESS;
    }
    else /*NRF_USBD_EP_OK*/
    {
        switch (p_msc_ctx->state)
        {
            case APP_USBD_MSC_STATE_CBW:
            {
                ret = state_cbw(p_inst);
                break;
            }

            case APP_USBD_MSC_STATE_CMD_OUT:
            {
                ret = csw_wait_start(p_inst, APP_USBD_MSC_CSW_STATUS_PASS);
                break;
            }

            case APP_USBD_MSC_STATE_DATA_OUT:
            {
                CRITICAL_REGION_ENTER();
                ret = state_data_out_handle(p_inst);
                CRITICAL_REGION_EXIT();
                break;
            }

            case APP_USBD_MSC_STATE_UNSUPPORTED:
            {
                ret = NRF_ERROR_NOT_SUPPORTED;
                break;
            }

            case APP_USBD_MSC_STATE_CSW:
                break;

            default:
            {
                ASSERT(0);
                ret = NRF_ERROR_NOT_SUPPORTED;
                break;
            }
        }
    }

    NRF_LOG_DEBUG("Ep proc status: %d", ret);
    return ret;
}


/**
 * @brief @ref app_usbd_class_methods_t::event_handler
 */
static ret_code_t msc_event_handler(app_usbd_class_inst_t const  * p_inst,
                                    app_usbd_complex_evt_t const * p_event)
{
    ASSERT(p_inst != NULL);
    ASSERT(p_event != NULL);

    app_usbd_msc_t const * p_msc     = msc_get(p_inst);
    app_usbd_msc_ctx_t   * p_msc_ctx = msc_ctx_get(p_msc);

    UNUSED_VARIABLE(p_msc);
    UNUSED_VARIABLE(p_msc_ctx);

    ret_code_t ret = NRF_SUCCESS;

    switch (p_event->app_evt.type)
    {
        case APP_USBD_EVT_DRV_SOF:
            break;

        case APP_USBD_EVT_DRV_RESET:
            break;

        case APP_USBD_EVT_DRV_SETUP:
            ret = setup_event_handler(p_inst, (app_usbd_setup_evt_t const *)p_event);
            break;

        case APP_USBD_EVT_DRV_EPTRANSFER:
            if (NRF_USBD_EPIN_CHECK(p_event->drv_evt.data.eptransfer.ep))
            {
                ret = endpoint_in_event_handler(p_inst, p_event);
            }
            else
            {
                ret = endpoint_out_event_handler(p_inst, p_event);
            }

            break;

        case APP_USBD_EVT_DRV_SUSPEND:
        {
            /*Flush all block devices cache on suspend*/

            for (size_t i = 0; i < p_msc->specific.inst.block_devs_count; ++i)
            {
                nrf_block_dev_t const * p_blkd = p_msc->specific.inst.pp_block_devs[i];
                (void)nrf_blk_dev_ioctl(p_blkd, NRF_BLOCK_DEV_IOCTL_REQ_CACHE_FLUSH, NULL);
            }

            break;
        }

        case APP_USBD_EVT_DRV_RESUME:
            break;

